In [1]:
import pandas as pd

## 1. 서울의 일교차

In [154]:
file = pd.read_csv("C:/Users/samsung-notebook/Desktop/jupyter_notebook/ta_20220519134827.csv", encoding='euc-kr', sep="\t", header=None)[7:]

In [155]:
df = pd.DataFrame(file).reset_index(drop=True)

In [156]:
df

                                  0
0      2021-01-01,108,-4.2,-9.8,1.6
1       2021-01-02,108,-5,-8.4,-1.4
2       2021-01-03,108,-5.6,-9.1,-2
3      2021-01-04,108,-3.5,-8.4,0.3
4     2021-01-05,108,-5.5,-9.9,-2.1
..                              ...
360  2021-12-27,108,-7.6,-12.9,-3.9
361   2021-12-28,108,-4.1,-8.5,-0.9
362     2021-12-29,108,0.4,-3.8,5.9
363    2021-12-30,108,-3.9,-6.8,0.2
364   2021-12-31,108,-6.7,-8.8,-3.9

[365 rows x 1 columns]

In [157]:
li = []
for i in range(df.shape[0]):
    li.append(str(df.iloc[i,0]))

### 일교차가 가장 큰 날

In [158]:
temp_diff = []
for day in li:
    temp_diff.append(abs(float(day.split(",")[-1]) - float(day.split(",")[-2])))
print(temp_diff.index(max(temp_diff)))

110

In [159]:
print("일교차가 가장 큰 날")
print(li[110].split(",")[0])

일교차가 가장 큰 날
2021-04-21

### 최저 기온이 가장 낮은 날

In [19]:
lowest = []
for day in li:
    lowest.append(day.split(",")[-2])
# print(lowest)

In [11]:
lowest.index(sorted(lowest)[-1])

299

In [20]:
print("최저 기온이 가장 낮은 날")
print(li[299].split(",")[0])

최저 기온이 가장 낮은 날
2021-10-27

### 최고 기온이 가장 높은 날

In [21]:
highest = []
for day in li:
    highest.append(day.split(",")[-1])

In [23]:
highest.index(max(highest))

14

In [25]:
print("최고 기온이 가장 높은 날")
print(li[14].split(",")[0])

최고 기온이 가장 높은 날
2021-01-15

## 2. 지하철 이용객

In [83]:
file = pd.read_csv("C:/Users/samsung-notebook/Desktop/jupyter_notebook/metro.csv", encoding='euc-kr')

In [84]:
metro_df = pd.DataFrame(file)[1:]

In [85]:
metro_df.head()

       사용월  호선명  역ID  지하철역    승차승객수    하차승객수                 작업일시
1  2021-12  1호선   10   동묘앞  235,271  242,269  2022-01-03 10:00:36
2  2021-12  1호선    2    시청  570,037  569,533  2022-01-03 10:00:36
3  2021-12  1호선    3    종각  872,179  849,374  2022-01-03 10:00:36
4  2021-12  1호선    4  종로3가  657,289  609,809  2022-01-03 10:00:36
5  2021-12  1호선    5  종로5가  579,293  573,290  2022-01-03 10:00:36

In [95]:
user1 = list(metro_df.loc[:,"승차승객수"])
user2 = list(metro_df.loc[:,"하차승객수"])

In [111]:
users = []
for i in range(metro_df.shape[0]):
    int_user1 = int(user1[i].replace(",",""))
    int_user2 = int(user2[i].replace(",",""))
    users.append(int_user1 + int_user2)

In [112]:
metro_df["total_users"] = users

In [113]:
metro_df

,사용월,호선명,역ID,지하철역,승차승객수,하차승객수,작업일시,total_users
1,2021-12,1호선,10,동묘앞,"235,271","242,269",2022-01-03 10:00:36,477540
2,2021-12,1호선,2,시청,"570,037","569,533",2022-01-03 10:00:36,1139570
3,2021-12,1호선,3,종각,"872,179","849,374",2022-01-03 10:00:36,1721553
4,2021-12,1호선,4,종로3가,"657,289","609,809",2022-01-03 10:00:36,1267098
5,2021-12,1호선,5,종로5가,"579,293","573,290",2022-01-03 10:00:36,1152583
...,...,...,...,...,...,...,...,...
604,2021-12,우이신설선,721,북한산보국문,"162,606","153,956",2022-01-03 10:00:36,316562
605,2021-12,우이신설선,722,정릉,"124,880","113,381",2022-01-03 10:00:36,238261
606,2021-12,우이신설선,723,성신여대입구(돈암),"91,571","101,326",2022-01-03 10:00:36,192897
607,2021-12,우이신설선,724,보문,"41,012","41,211",2022-01-03 10:00:36,82223
608,2021-12,우이신설선,725,신설동,"55,769","54,272",2022-01-03 10:00:36,110041

In [129]:
highest_df = metro_df.sort_values("total_users", ascending=False)
lowest_df = metro_df.sort_values("total_users")

In [131]:
highest_df.head(3)

,사용월,호선명,역ID,지하철역,승차승객수,하차승객수,작업일시,total_users
31,2021-12,2호선,32,강남,"2,193,108","2,171,328",2022-01-03 10:00:36,4364436
25,2021-12,2호선,26,잠실(송파구청),"1,976,472","1,951,450",2022-01-03 10:00:36,3927922
39,2021-12,2호선,40,신림,"1,733,842","1,678,357",2022-01-03 10:00:36,3412199

In [132]:
lowest_df.head(3)

         사용월  호선명  역ID 지하철역 승차승객수 하차승객수                 작업일시  total_users
331  2021-12  경의선  204   검암     2     0  2022-01-03 10:00:36            2
330  2021-12  경의선  203   계양     8     0  2022-01-03 10:00:36            8
192  2021-12  경원선  142   창동     8     0  2022-01-03 10:00:36            8

In [135]:
highest_users = list(highest_df.loc[:,"지하철역"])
highest_count = list(highest_df.loc[:, "total_users"])

lowest_users = list(lowest_df.loc[:,"지하철역"])
lowest_count = list(lowest_df.loc[:, "total_users"])

In [143]:
print("이용객이 가장 많은 역 순위")
for i, (user, count) in enumerate(zip(highest_users[:3], highest_count[:3])):
    print(str(i+1)+".", user, count)

이용객이 가장 많은 역 순위
1. 강남 4364436
2. 잠실(송파구청) 3927922
3. 신림 3412199

In [144]:
print("이용객이 가장 적은 역 순위")
for i, (user, count) in enumerate(zip(lowest_users[:3], lowest_count[:3])):
    print(str(i+1)+".", user, count)

이용객이 가장 적은 역 순위
1. 검암 2
2. 계양 8
3. 창동 8